# yolov8-custom.yaml

# Parameters
nc: 80  # Number of classes

# Model scaling parameters
scales:
  # [depth, width, max_channels]
  n: [1, 1, 1024]  # Adjusted to match backbone output

# Backbone configuration
backbone:
  # [from, repeats, module, args]
  - [-1, 1, DinoV2Patches, [1024, 'large']]  # Outputs 1024 channels

# Add localization layers
  - [-1, 1, Conv, [512, 3, 1]]  # Reduce channels, add spatial refinement
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # Optional: increase resolution 
  - [-1, 3, C3, [512]]  # Add YOLO C3 block for better feature refinement
  - [-1, 1, SPPF, [512, 5]]  # Multi-scale feature fusion

# Head configuration
head:
  # [from, repeats, module, args]
  - [[-1], 1, Segment, [nc, 32, 256]]  # Connect to the last localization layer