# yolo-uni.yaml

# Parameters
nc: 80  # Number of classes for Pascal VOC

# Model scaling parameters
scales:
  # [depth, width, max_channels]
  n: [1, 1, 1024]  # UNI has 1024 feature dimensions (ViT-L)

# Backbone configuration
backbone:
  # [from, repeats, module, args]
  - [-1, 1, UNIMultiLayerPatches, [1024, [23], 'list']]  # UNI outputs feature maps from multiple layers
  - [0, 1, Index, [0]]  # 1: output from layer 23

# Head configuration
head:
  # [from, repeats, module, args]
  - [[-1], 1, Segment, [nc, 32, 256]]