# yolo-uni.yaml

# Parameters
nc: 80  # Number of classes for Pascal VOC

# Model scaling parameters
scales:
  # [depth, width, max_channels]
  n: [1, 1, 1024]  # UNI has 1024 feature dimensions (ViT-L)

# Backbone configuration
backbone:
  # [from, repeats, module, args]
  - [-1, 1, UNIPatches, [1024]]  # UNI outputs 1024 channels
  
  # Add localization layers
  - [-1, 1, Conv, [512, 3, 1]]  # Reduce channels, add spatial refinement
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # Optional: increase resolution 
  - [-1, 3, C3, [512]]  # Add YOLO C3 block for better feature refinement
  - [-1, 1, SPPF, [512, 5]]  # Multi-scale feature fusion

# Head configuration
head:
  # [from, repeats, module, args]
  - [[-1], 1, Segment, [nc, 32, 256]]  # Same segmentation head as DinoV2